app/controllers/api/pets_controller.rb

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        # to avoid N+1 queries from Active Storage
        @pet = Pet.with_attached_photos.find(params[:id])

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 87], ["LIMIT", 1]]
---
    def adopt
        @pet = Pet.find(params[:id])